Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Теперь при включении редактирования явно отображается выделенный класс, а кнопки «Объединить с предыдущим» и «Объединить со следующим» становятся неактивными, если действие невозможно выполнить (#8578).
en: Now, when enabling the editing mode, the selected class is clearly displayed, and "Merge with previous" and "Merge with next" buttons become inactive if the action cannot be performed (#8578).

source: Теперь при написании формулы сразу же появляется возможность посмотреть, какие получаются результаты на примере первых 100 записей, причем отображаются как поля, которые используются в формулах, так и результаты вычислений, что удобно для визуального сравнения корректности расчетов.
en: Now, when writing a formula, it became possible to view the results by the example of the first 100 records at once. And both the fields used in the formulae and calculation results are displayed that facilitates visual comparison of the calculation correctness.

source: Теперь пункт меню «Показать визуализаторы» отображается только для узлов (#5088).
en: Now, "Show visualizers" menu item is shown only for the nodes (#5088).

source: Теперь такой пакет откроется (#9099).
en: Now, such package will be opened (#9099).

source: Теперь экспорт в эту базу данных выполняется построчно (#8783).
en: Now, export to this database is performed in a row-by-row manner (#8783).

source: Теперь это можно сделать в настройках сервера и настольных приложений, для чего добавлен специальный параметр «Трассировка исключений».
en: Now it can be done in the server settings and desktop applications. Special parameter "Trace exceptions" was added for this purpose.

source: Теперь явно проверяется наличие у узла хотя бы одного активного входного порта и если все входные порты узла неактивны, то узел остаётся неактивным, при этом не возникает ошибок.
en: Now, the node is explicitly checked for, at least, one active input port, and if all input ports are inactive, the node is inactive, no mistakes occur in this case.

source: Теперь, если не удалось определить значение в поле Выбор объекта, просмотр в мастере настройки импорта не будет показан, а выпадающий список листов будет пустым (#9533).
en: Now, if it is not possible to define the value in Object selection field, view will not be displayed in the import wizard, and drop-down list of sheets will be empty (#9533).

source: Теперь, если опубликованный узел отработал успешно, а при закрытии пакета возникла ошибка, то запрос в Loginom Integrator завершится успешно.
en: Now, if the published node successfully finished its operation, and an error occurred when closing the package, request to Loginom Integrator was successfully finished.

source: Теперь, если открывается пакет, содержащий компонент Loginom недоступный в текущей редакции, пользователь получит сообщение в котором указано какой именно компонент недоступен (#6093).
en: Now, if it is required to open the package that contains the Loginom component that is not available in the current edition, a user will receive the message in which it is specified which component is not available (#6093).

source: Теперь, если при настройке узла возникает такая ситуация, открывается страница «Настройка соответствия между деревьями данных» (#8659).
en: Now, if such situation arises during the node configuration process, the following page is opened: "Adjustment of Data Trees Mapping" (#8659).

source: Термин Противоречие
en: The Contradiction Notion

source: Требуется установить SQL Server Native Client (#9154).
en: It is required to install SQL Server Native Client (#9154).

source: У Пользователя есть возможность самостоятельно установить для выходных столбцов «Назначения по умолчанию».
en: The User can set "Default usage types" for the output columns at his discretion.

source: У вновь установленного сервера лог-файлы будут в кодировке UTF8.
en: The log files of the newly installed server will be in UTF8 encoding.

source: У разных версий и редакций Loginom разные возможности.
en: Different Loginom versions and editions provide different options.

source: У элемента loginom добавлен необязательный атрибут swaggerUI, который может принимать значение true или false.
en: For loginom element optional swaggerUI attribute was added. It can take true or false value.

source: У элемента loginom добавлен необязательный атрибут urlPathPrefix, значение которого используется как префикс к адресу всех конечных точек REST и SOAP.
en: For loginom element optional urlPathPrefix attribute was added. Its value is used as prefix to address of all REST and SOAP end points.

source: Убрали ее из заголовка.
en: It was deleted from the title.

source: Убрана кнопка «Просмотр» с панели инструментов сценария.
en: "View" button was removed from the workflow toolbar.

source: Увеличена скорость работы REST-клиент, особенно, когда в одном узле производится большое количество обращений к веб-сервису.
en: REST client operation speed was increased particularly when web service was accessed many times in one node.

source: Увеличение скорости чтения данных в Loginom Data файл.
en: Increase of the data reading speed in the Loginom Data file.

source: Удалена автоматическая корректировка ссылок на пакеты, если при загрузке ссылки не удалось найти пакет, но пакет с соответствующим именем файла найден в текущей папке (рядом с пакетом, содержащим ссылку).
en: The autocorrect of references to packages was deleted if it was not possible to find the package while reference loading but the package with corresponding file name was found in the current folder (near the package that included the reference).

source: Удаление, перемещение, переименование файлов.
en: Delete, move, rename files.

source: Удалены элементы appSettings, system.web, system.serviceModel и system.webServer вместе со всеми дочерними элементами.
en: appSettings, system.web, system.serviceModel and system.webServer elements were deleted with all child elements.

source: Удобный функционал переиспользования компонентов.
en: Convenient functionality of components reuse.

source: Удобство использования
en: Ease of Use

source: Удобство использования и повышение информативности
en: Ease of Use and UI/UX Improvements

source: Узел Python, активированный в процессе выполнения другого узла Python, будет ожидать завершения работы первого узла, даже если не является зависимым от него.
en: The Python node activated in the process of another Python node execution will wait for completion of the first node operation even if it does not depend on it.

source: Узел «Веб-сервисы» в панели навигации
en: "Web services" navigation panel node

source: Узел находился в нижнем углу видимой части сценария, тогда как должен был находиться в том месте, куда его добавили при измененном масштабе.
en: The node was located in the lower corner of the visible workflow part. But it was to be located in the same place where it was added when changing the scale.

source: Узел не сообщал об имеющихся в таблице замен дубликатах, а результат выполнения мог быть неправильным.
en: The node did not provide information on the duplicates in the replacement table, and the execution result could be incorrect.

source: Улучшен инсталлятор.
en: Installer was improved.

source: Улучшена и оптимизирована работа с базами данных.
en: Databases operation was improved and optimised.

source: Улучшена работа некоторых компонентов.
en: Operation of some components was improved.

source: Улучшение в работе с базами данных
en: Database Use Improvements

source: Улучшение исключает логическую ошибку (#9052).
en: Improvement excludes the logical error (#9052).

source: Улучшения
en: Improvements

source: Улучшения в OLAP-кубе
en: OLAP Cube Improvements

source: Улучшения в импорте данных
en: Data Import Improvements

source: Улучшения в компонентах обработки
en: Processing Components Improvements

source: Улучшения работы с веб-сервисами
en: Web Services Operation Improvements

source: Уникальные значения выделены оранжевым цветом, порядковые статистики — красным.
en: The unique values are highlighted in orange, the order statistics are highlighted in red.

source: Унифицированы имена переменных, а также описания долей событий и классов.
en: Variables names and descriptions of rates of events and classes were unified.

source: Управление пользователями Loginom
en: Loginom users administration

source: Уровни заголовков
en: Headers Levels

source: Устранен ряд проблем с производными компонентами.
en: Some problems with derived components were eliminated.

source: Устранили несколько регрессионных ошибок, в том числе в Подключениях к базам данных.
en: Several regression errors were corrected, including in Connection to databases.

source: Файл сокета создаётся в рабочей директории Loginom Server и имеет имя loginomd.socket.
en: Socket file is created in the work Loginom Server directory, and it has loginomd.socket name.

source: Фильтрация
en: Filtering

source: Фильтрация срабатывала после изменения значения для сравнения на отличное от значения по умолчанию, а затем на нужное пользователю (0, "").
en: Filtering was effective after replacing the compare value with the value different from the default value and then with the value needed for the user (0, "").

source: Формат по умолчанию для Даты и Времени сделан Фиксированный ("2021-01-30", "23:59:59", "01:01:01") (#8595).
en: The default Date and Time format was Fixed ("2021-01-30", "23:59:59", "01:01:01") (#8595).

source: Формат по умолчанию для Дня месяца сделан с ведущим нулем.
en: The default month day format was with leading zero.

source: Формирование выходного набора данных из кода в компоненте JavaScript.
en: Generation of the output data set from the code in the JavaScript. component.

source: Функционал фильтрации не должен снимать отметку о выборе поля, внесены необходимые исправления (#4159).
en: Filtration functionality must not enable deselection of field selection, required correction were made (#4159).

source: Хранилище данных
en: Data Warehouse

source: Циклические связи между узлами запрещены».
en: Circular links between nodes are not allowed".

source: Чаще всего ошибка возникала в Предпросмотре узла JavaScript, т.к. в этом случае обрабатываются только первые 100 строк набора данных и скрипт останавливается (#9876).
en: Most often, the error occurred in Preview of JavaScript node because in this case only the first 100 rows of the data set were processed and the script stopped (#9876).

source: Чем больше итераций было выбрано в настройках Цикла, тем выше была вероятность возникновения ошибки (#8531).
en: The higher number of iterations was selected in the Loop settings, the higher risk of error occurrence was identified (#8531).

source: Чем дальше узел находился от левого верхнего угла области построения сценария, тем дальше от него появлялся клонированный узел.
en: The further the node was located from the left upper corner of the workflow construction area, the futher the cloned node appeared from it.

source: Чтобы эта ошибка не возникала, необходимо на предыдущей версии Loginom удалить пользователя с именем «everyone», после чего выполнить обновление на новую версию Loginom.
en: To avoid this error, it is required to delete the user with "everyone" name in the previous Loginom version, and then update is required to provide the new Loginom version.

source: Эта возможность позволяет визуально контролировать корректность расчетов в каждом узле сценария, оперативно обнаруживать ошибки.
en: This option provides visual control of the calculation correctness in each workflow node and detection of errors in a timely manner.

source: Эта же ошибка могла возникать при открытии пакета, содержащего подобную конфигурацию узлов.
en: The same error could occur while opening the package containing the same node configuration.

source: Эта опция удобна в случае неправильного написания сложных запросов к базам данных, на подготовку которых СУБД могла тратить продолжительное время, иногда сопоставимое со временем, требуемым на получение результирующих данных.
en: This option is convenient in the case of incorrect writing of the complex requests to the databases for preparation of which DBMS could spend the long time that is sometimes comparable with the time that is required for receipt of the resulting data.

source: Эта функция актуальна, когда речь идет об обработке многоязычных текстовых данных или данных типа дата-время.
en: This option is relevant when it is required to process the multilingual text files or date-time data.

source: Эти заголовки влияют на генерируемые URL-ы в OpenAPI документах и на help-странице для REST-сервиса.
en: These headers influence the generated URLs in OpenAPI documents and on help page for REST service.

source: Эти компоненты получают метки вида «Метка_узла (открытый узел)» или «Метка_узла (опубликованный узел)» в зависимости от модификатора доступа узлов, по которым они созданы.
en: These components receive "Node_caption (public node)" or "Node_caption (published node)" captions according to the visibility of the nodes by which they have been created.

source: Эти компоненты получают такую же метку и модификатор доступа, как и исходный узел.
en: These components receive the same caption and visibility as the source node.

source: Эти строки нигде не использовались, при этом они могли приводить к появлению ошибок в некоторых приложениях (например, 1С), которые подключались к Интегратору (#10296).
en: These rows were never used but they could cause errors in some applications (for example, 1C) connected to Integrator (#10296).

source: Это актуально, если у столбцов pandas таблицы метки записаны кириллицей.
en: This is especially true if captions of pandas columns are written in Cyrillic characters.

source: Это будет означать, что workdir совпадает с configdir.
en: It will mean that workdir matches configdir.

source: Это же касается разработанных прикладных решений.
en: The same goes for the designed application solutions.

source: Это изменение может быть значимым, если была настроена автоматическая обработка лог-файлов при помощи скриптов.
en: This change will be very important if the automatic processing of log files is set when using scripts.

source: Это можно выполнить при помощи контекстного меню или с помощью стандартных горячих клавиш (Ctrl+x, Ctrl+c, Ctrl+v для ОС Windows).
en: It can be done using the context menu or the standard hotkeys (Ctrl+x, Ctrl+c, Ctrl+v for Windows OS).

source: Это относится к дубликатам как во внутренней так и во внешней таблице замен (#4450, ##7434, #9624).
en: It is applicable to the duplicates both in the internal and external replacement tables(#4450, ##7434, #9624).

source: Это позволило более полно отображать названия свойств в условиях ограниченной ширины окна Инспектора свойств.
en: It enabled to display the property names more fully under conditions of limited width of the Property Inspector window.

source: Это позволяет оценить соответствие между данными, использованными при построении и применении модели, а в случае существенного расхождения — перестроить модель.
en: It enables to estimate compliance of the data used when model training and using. If significant inconsistency was detected, it is required to retrain the model.

source: Это позволяет редактировать подключенный пакет, если кроме текущей сессии пользователя он никем не используется.
en: It enables to edit the connected package if nobody uses it with exception of the current user session.

source: Это предотвратит возникновение более серьёзных ошибок на следующих этапах.
en: It will prevent occurrence of more serious errors at the next stages.

source: а также на визуализаторы:
en: and also to the following visualizers:

source: было:
en: before:

source: в 10 раз (со 100 до 1000) увеличилось количество максимально отображаемых серий в кросс-диаграмме;
en: the number of maximally displayed series in the cross chart was increased by 10 times (from 100 to 1000);

source: в Integrator Team используется подключение только к unix socket.
en: connection only to unix socket is used in Integrator Team.

source: в визуализаторе Конечные классы в метках границ классов (#9733);
en: in the Coarse classes visualizer in class bounds captions (#9733);

source: в визуализаторе Отчет по регрессии в описании показателей модели (#9736);
en: in Regression report visualizer in description of the model parameters (#9736);

source: в визуализаторе Профили кластеров для значений минимум, максимум и среднее поля типа Дата/Время (#9732);
en: in the Cluster profiles visualizer for the minimum, maximum and average values of the Date/Time field (#9732);

source: в визуализаторе Статистика на гистограмме, а также для значений минимум и максимум поля типа Дата/Время (#9728).
en: in the Statistics visualizer on the histogram and also for the minimum and maximum values of the Date/Time field (#9728).

source: в гистограмме визуализатора Качество данных (#9731);
en: in Data quality visualizer histogram (#9731);

source: в мастере настройки Импорта из базы данных при выборе таблицы, в которой есть поля типа JSON;
en: in Import from database wizard when selecting the table with JSON fields;

source: в окне настройки фактов добавлена иконка калькулятора у вычисляемых фактов.
en: The calculator icon for the calculated measures was added in the measure configuration window.

source: в противном случае используется папка, в которой находится файл Integrator.dll.
en: otherwise the folder with Integrator.dll file is used.

source: в режиме SQL-запрос в дереве объектов БД доступен функционал фильтрации полей (при развернутом дереве);
en: field filtration functionality is available in the SQL query mode in the DB object tree (when tree is expanded);

source: в режиме SQL-запроса добавлен блок со списком переменных;
en: block with a list of variables was added in the SQL query mode;

source: валидные символы переносятся без изменений;
en: valid characters are transferred without changes;

source: все остальные невалидные символы заменяются символом подчеркивания «_»;
en: all other invalid characters are replaced with «_» underscore character;

source: для контейнеров в древовидной структуре данных.
en: for the containers in the tree-like data structure.

source: для свойств, соответствующих портам узла;
en: for the properties that match the node ports;

source: для свойства Rows в наборе данных;
en: for the Rows properties in the data set;

source: до 2-х раз повысилась отзывчивость интерфейса при работе с большими наборами данных;
en: the interface responsiveness was increased by 2 times when working with large data sets;

source: добавлена возможность группового управления видимостью серий в диаграмме: «Показать все серии», «Скрыть все серии», «Инвертировать серии».
en: group control of series visibility in the chart was added: "Show all series", "Hide all series", "Invert series".

source: добавлена возможность изменять цвет серий на графике в диаграмме;
en: it became possible to change the series color in the chart graph;

source: добавлено контекстное меню в диаграмме;
en: the context menu was introduced into the chart;

source: если в командной строке указан параметр configdir, то используется указанная папка (имя параметра можно указать в любом регистре);
en: if configdir parameter is specified in the command line, the specified folder is used (the parameter name can be specified in any register;

source: если в конфигурационном файле Интегратора указаны атрибуты unixsocket и host, то сначала выполняется попытка подключения к unix socket, а если это не удалось, то по TCP;
en: if unixsocket and host attributes are specified in the Integrator configuration file, first, an attempt to establish connection to unix socket is made, and if that failed, TCP is used for connection;

source: если в файле конфигурации не указано ни одного элемента server, то сначала выполняется попытка подключиться к unix socket, а затем - по TCP;
en: if no server elemet is specified in the configuration file, first, an attempt to establish connection to unix socket is made, and then TCP is used for connection;

source: если имя начинается с цифры, то в начало имени добавляется символ подчеркивания «_»;
en: if a name starts from a digit, «_» underscore character is added at the start of the name;

source: если исходное имя состоит только из знаков подчеркивания, то оно же будет использовано на выходе;
en: if the source name consists of the underscore characters only, it will be used at the output;

source: если на левом экране дважды развернуть приложение на весь экран с помощью клавиш Win+Up, то часть окна отображалась на правом мониторе (при использовании одного экрана в этом случае часть окна оказывалась под Панелью задач) (#8296).
en: if the application was deployed two times to full screen using Win+Up keys on the left screen, a part of the window was displayed on the right screen (when using one screen, a part of the window was under the Taskbar(#8296).

source: если параметр не указан, и в текущей папке ($PWD) есть файл Integrator.dll.config, то используется текущая папка;
en: if the parameter is not specified and in the current folder ($PWD) there is Integrator.dll.config file, the current folder is used;

source: если после преобразований получается пустая строка или строка, состоящая только из символов подчеркивания, то считаем это непригодным идентификатором и возвращаем значение по умолчанию.
en: if an empty string or the string that consists of the underscore characters only is generated after such transformations, such identifier is considered to be unsuitable, and the default value is returned by default.

source: закрепленная снизу панель.
en: bar is fixed on the bottom.

source: значение для определения периода — базовая дата, тип временного промежутка и значение временного промежутка для фильтров: первый, не первый, последний не последний.
en: the value for the period definition — base date, time span unit and value of the time span for filters: first, not first, last, not last.

source: значение для сравнения для фильтров: =, <>, <, <=, >, >= , содержит, не содержит, начинается, не начинается, заканчивается, не заканчивается;
en: the value for comparison for filters: =, <>, <, <=, >, >= , contains, does not contain, starting, not starting, ending, not ending;

source: значение переменной может быть вставлено в редактор SQL кода как параметр (по умолчанию) или как макроподстановка;
en: variable value can be inserted into SQL code editor as parameter (by default) or as macro substitution;

source: значения границ интервала для фильтров: в интервале и вне интервала;
en: the interval boundaries for filters: within the range and out of the range;

source: клиента Microsoft OLE DB Driver for SQL Server для подключения к MS SQL Server.
en: Microsoft OLE DB Driver client for SQL Server for connection to MS SQL Server.

source: когда фокус находился в поле поиска в панели фильтра измерения «Куба», то вместо копирования содержимого текстового поля происходило копирование состояния фильтра (#9105).
en: when the focus was in the search field in the "Cube" dimension filter bar, the filter state was copied instead of the text field content (#9105).

source: любое число строк, если тип данных Логический.
en: any row count if the Logical data type is used.

source: максимизированное модальное окно;
en: modal window is maximized;

source: множественный; режимы включенных и исключенных значений — копируются все включенные/исключенные значения, успешно распознанные значения добавляются во включенные/исключенные значения при вставке;
en: multiple; modes of included and excluded values — all included/excluded values are copied, successfully captured values are added to the included/excluded values while pasting;
